[
    {
        "intent": "fun.qod",
        "utterances": [
            "quote of the day"
        ]
    },
    {
        "intent": "fun.catfact",
        "utterances": [
            "tell me a cat fact",
            "random facts about cats"
        ]
    },
    {
        "intent": "fun.fact",
        "utterances": [
            "tell me something",
            "tell me a random fact",
            "random fact",
            "teach me something new",
            "I want to learn something",
            "fun fact"
        ],
        "answers": [
            "Approximately 40 percent of the U.S. paper currency in circulation was counterfeit by the end of the Civil War.",
            "Every three days a human stomach gets a new lining.",
            "In 1873, Colgate made a toothpaste that was available in a jar.",
            "The Kodiak, which is native to Alaska, is the largest bear and can measure up to eight feet and weigh as much as 1,700 pounds.",
            "Mars is the home of Olympus Mons, the largest known volcano in our solar system.",
            "The Gastric Flu can cause projectile vomiting.",
            "The second best selling game of all time is Jenga. Jenga is a Swahili word, meaning \"to build.\"",
            "Cinderella is known as Rashin Coatie in Scotland, Zezolla in Italy, and Yeh-hsien in China.",
            "The name Wendy was made up for the book \"Peter Pan.\"",
            "The fur of the binturong, also known as the \"Asian Bear Cat,\" smells like popcorn. The scent is believed to come from a gland located near the tail.",
            "In 1894 the first big Coke sign was found on the side of a building located in Cartersville, Georgia, and still exists today.",
            "The longest distance a deepwater lobster has been recorded to travel is 225 miles.",
            "Orcas (killer whales), when traveling in groups, breathe in unison.",
            "The Great Pyramids used to be as white as snow because they were encased in a bright limestone that has worn off over the years.",
            "NASCAR stands for National Association for Stock Car Auto Racing.",
            "Percentage of American men who say they would marry the same woman if they had it to do all over again: 80 percent.",
            "Paul Hunn holds the record for the loudest burp, which was 118.1 decibels, which is as loud as a chainsaw.",
            "A monkey was once tried and convicted for smoking a cigarette in South Bend, Indiana.",
            "There are six million parts in the Boeing 747-400.",
            "The first TONKA truck was made in 1947",
            "In the U.S., over one million gallons of cosmetics, drinks, and lotions are sold that contain aloe in them per year.",
            "Sugar Bear (the mascot for Golden Crisps cereal) was born in 1963",
            "The Tonle Sap River in Cambodia flows north for almost half the year and then south for the rest of the year.",
            "Japanese research has concluded that moderate drinking can boost IQ levels.",
            "For more than 3,000 years, Carpenter ants have been used to close wounds in India, Asia and South America.",
            "Baskin Robbins plain vanilla ice cream is the number one selling flavour and accounts for a quarter of their sales.",
            "Elizabeth Taylor has appeared on the cover of Life magazine more than anyone else.",
            "The typical lead pencil can draw a line that is thirty five miles long.",
            "The word \"toy\" comes from an old English word that means \"tool.\"",
            "Smokers are twice as likely to develop lower back pain than non-smokers.",
            "Humans are born with 300 bones in their body, however when a person reaches adulthood they only have 206 bones. This occurs because many of them join together to make a single bone.",
            "The reason why hair turns gray as we age is because the pigment cells in the hair follicle start to die, which is responsible for producing \"melanin\" which gives the hair colour.",
            "In 1960 there were 16,067 gambling slots in Nevada. By 1999, this number rose to 205,726 slots which would be one slot for every 10 people residing there.",
            "It takes the Hubble telescope about 97 minutes to complete an orbit of the Earth. On average, the Hubble uses the equivilent amount of energy as 30 household light bulbs to complete an orbit.",
            "The two factories of the Jelly Belly Candy Company produces approximately 100,000 pounds of jelly beans a day. this amounts to about 1,250,000 jelly beans an hour.",
            "Pucks hit by hockey sticks have reached speeds of up to 150 miles per hour.",
            "The \"naked recreation and travel\" industry has grown by 233 percent in the past decade.",
            "The Planters Peanut Company mascot, Mr. Peanut, was created during a contest for schoolchildren in 1916",
            "Most lipstick contains fish scales.",
            "The sentence \"the quick brown fox jumps over the lazy dog\" uses every letter in the english language.",
            "The expression cooked \"al dente\" means \"to the tooth.\" What this means is that the pasta should be somewhat firm, and offer some resistance to the tooth, but should also be tender.",
            "Of married couples, 70 percent of men and 60 percent of women have cheated on their spouse.",
            "No piece of paper can be folded in half more than 7 times.",
            "More people are killed by donkeys annually than are killed in plane crashes.",
            "The first couple to be shown on a sitcom sleeping in the same bed was \"Mary Kay and Johnny.\"",
            "Asthma affects one in fifteen children under the age of eighteen.",
            "A one ounce milk chocolate bar has 6 mg of caffeine.",
            "Throughout the South, peanuts were known as \"Monkey Nuts,\" and \"Goober peas,\" before the civil war.",
            "Scallops have approximately 100 eyes around the edge of its shell.",
            "In 1810, Peter Durand invented the tin can for preserving food.",
            "The fear of peanut butter sticking to the roof of the mouth is called Arachibutyrophobia.",
            "Men in their early twenties shave an average of four times a week.",
            "Colour is not an indicator for the taste or ripeness in cranberries.",
            "Each year there are approximately 20 billion coconuts produced worldwide.",
            "A chicken with red earlobes will produce brown eggs, and a chicken with white earlobes will produce white eggs.",
            "Not all polar bears hibernate; only pregnant females polar bears do.",
            "There is a restaurant in Stockholm that only offers all-garlic products. They even have a garlic cheesecake.",
            "Serving ice cream on cherry pie was once illegal in Kansas.",
            "Superman The Escape roller coaster, located in California at Six Flags Magic Mountain, goes from 0 to 100 miles per hour in only 7 seconds.",
            "Five thousandths of a millimeter is the tolerance of accuracy at the LEGO mould factories.",
            "2.5 cans of Spam are consumed every second in the United States.",
            "In 1836, Mexican General Santa Anna held an elaborate state funeral for his amputated leg.  updated.",
            "A meteor has only destroyed one satellite, which was the European Space Agency's Olympus in 1993.",
            "The Koala bear is not really a bear, but is really related to the kangaroo and the wombat.",
            "One gallon of pure maple syrup weighs 11 pounds.",
            "Instead of a Birthday Cake, many Russian children are given a Birthday Pie.",
            "The largest employer in the world is the Indian railway system in India, employing over 1.6 million people.",
            "The word \"comet\" comes from the Greek word \"kometes\" meaning long hair and referring to the tail.",
            "The hydra, which is related to the jellyfish, can grow its body back in a couple of days if it is cut in half.",
            "The deepest mine in the world is the East Rand mine, which goes to a depth of about 3,585 metres.",
            "Native Indians have been known to paint their doors blue, which they believe keeps the bad spirits out.",
            "Before air conditioning was invented, white cotton slipcovers were put on furniture to keep the air cool.",
            "It would take about fourteen and half million notes of currency to build a mile high stack.",
            "Chinese Crested dogs can get acne.",
            "Colgate faced a big obstacle marketing toothpaste in Spanish speaking countries. Colgate translates into the command \"go hang yourself.\"",
            "The cross bow was invented by the Chinese and records of its usage goes back to as far as the Three Kingdom Period (220 a.d.-280 a.d.).",
            "It is estimated that by the end of 2000, there has been 142,600 tonnes of gold mined in the world.",
            "One-third pound stalk of broccoli contains more vitamin C than 204 apples.",
            "The Flintstones cartoon was the first thirty-minute cartoon to be aired during prime time.",
            "The abbreviation Xmas for the word Christmas is of Greek origin. Since the word for Christ in the Greek language is Xristos, which starts with the letter \"X,\" they started putting the X in place of Christ and came up with the short form for the word Christmas.",
            "Dipsomania refers to an insatiable craving for alcoholic beverages.",
            "China has more English speakers than the United States.",
            "In a day, kids in the U.S. that are between the ages of 2 - 8 spend 28 minutes of their time coloring.",
            "The Ancient Greek women made a type of cheek blush by painting their cheeks with herbal pastes which was made out of crushed berries and seeds.",
            "Herbert Hoover, who was the 31st president of the United Stated, turned over all the Federal salary checks he received to charity during the 47 years he was in government.",
            "Macadamia nuts are not sold in their shells because it takes 300 pounds per square inch of pressure to break the shell.",
            "Japan has approximately 200 volcanoes and is home to 10 percent of the active volcanoes in the world.",
            "Before 1928, yo-yos used to be called bandalores in the United States.",
            "The only South East Asian country that has never been colonized by a Western Power is Thailand.",
            "In 1631, two London bible printers accidentally left the word \"not\" out of the seventh commandment, which then read, \"Thou shalt commit adultery.\" This legendary book is now known as the \"Wicked Bible.\"",
            "The shortest war in history was between Zanzibar an England in 1896. Zanzibar surrendered after 38 minutes.",
            "Irish Wolfhound dogs have a short lifespan and live about 7-8 years.",
            "When Queen Elizabeth I of England died she owned over 3,000 gowns.",
            "Female alligators lay about 40 eggs that hatch in 60 - 70 days.",
            "The nickname for a Japanese businessmen is \"Salarymen.\"",
            "Emus cannot walk backwards.",
            "The external tank on space shuttles is not painted. It is the only part of the shuttle that is lost after launch, so it is not necessary to worry about metal corrosion.",
            "The most popular Twizzler candy flavour is strawberry.",
            "Thirty percent of all bingo players are under the age of 35",
            "Infants spend more time dreaming than adults do.",
            "The famous Casanova (Giacomo Casanova) was a librarian for many years before he died.",
            "The only species of turtle that lives in the open ocean is the sea turtle.",
            "Toronto was the first city in the world with a computerized traffic signal system.",
            "Seniors who drink a cup of coffee before a memory test score higher than those who drink a cup of decaffeinated coffee.",
            "Venus is the only planet that rotates clockwise.",
            "Some octopuses have been known to eat their arms off when they are exposed to stressful situations.",
            "On average, 749 pounds of paper products is used by an American individual annually.",
            "The skeleton of a spider is located on the outside of the body. The name for this is exoskeleton.",
            "Incas used to create pots in the shape of peanuts that were highly prized.",
            "The letter J does not appear anywhere on the periodic table of the elements.",
            "Over 200 varieties of watermelons are grown in the U.S",
            "The most dangerous job in the United States is that of a fisherman, followed by logging and then an airline pilot.",
            "The words \"abstemious,\" and \"facetious\" both have all the five vowels in them in order.",
            "French soldiers during World War I had the nickname \"poilu\" which translates to \"hairy one.\"",
            "Former U.S. President William Taft converted the White House stable into a four car garage in 1909",
            "People living on the east coast prefer creamy peanut butter, while people living on the west coast prefer chunky peanut butter.",
            "Some snails live on branches in trees.",
            "Tomato ketchup is a good conditioner for the hair. It also helps get the greenish tinge that some blonde haired people get after swimming in water with chlorine in it.",
            "The youngest pope was 11 years old.",
            "Did you know you share your birthday with at least 9 other million people in the world.",
            "Soldiers disease is a term for morphine addiction. The Civil War produced over 400,000 morphine addicts.",
            "The longest chapter in the Bible is Psalm 119, which is 176 verses.",
            "During the First World War, cigarettes were handed out to soldiers along with their rations.",
            "The longest freshwater shoreline in the world is located in the state of Michigan.",
            "There are bananas called \"Red banana\" that are maroon to dark purple when ripe.",
            "Franklin Pierce was the first U.S. President to have a Christmas tree in the White House.",
            "The USA bought Alaska from Russia for 2 cents an acre.",
            "Walt Disney had originally suggested using the name Mortimer Mouse instead of Mickey Mouse.",
            "The length of brink of the Canadian \"Horseshoe\" Falls located in Niagara Falls, Ontario, Canada is 2600 feet.",
            "The smile is the most frequently used facial expression. A smile can use anywhere from a pair of 5 to 53 facial muscles.",
            "The right lung of a human is larger than the left one. This is because of the space and placement of the heart.",
            "Native Americans used to use pumpkin seeds for medicine.",
            "The pound key (#) on the keyboard is called an octothorpe.",
            "The chemical name for caffeine is 1,3,7-trimethylzantihine."
        ]
    },
    {
        "intent": "fun.trivia",
        "utterances": [
            "trivia",
            "quiz me",
            "ask me a trivia question",
            "play trivia"
        ]
    },
    {
        "intent": "fun.pickupline",
        "utterances": [
            "what's your favorite pick up line",
            "tell me a pick up line",
            "I wanna hear a pick up line",
            "random pick up line"
        ],
        "answers": [
            "If I had a dime for every time I thought of you... I'd have one dime ...cuz baby, u never leave my mind",
            "Hey girl, are you a cast? Cause I'd jump off a roof to have you on my arm",
            "Are you Abraham Lincoln? Because you're causing an uprising down south",
            "Hey baby what's your blood type? Cause I wanna know if I can give you my heart",
            "Are you an archaeologist because I've got a bone for you to examine",
            "I heard you were good at algebra, will you replace my X without asking Y?",
            "Hey do you wash your clothes in windex? Because I could see myself in your pants",
            "If you were a potato, you'd be a hot potato",
            "Hey girl, are you an NVIDIA Fermi graphics card? Because you are HOT",
            "Are you my appendix? Because I don't understand how you work, but this feeling in my stomach makes me wanna take you out",
            "Are you a sea lion? Because I can sea you lion in my bed later",
            "Are you an undecided voter? Because I was wondering if we Ken Bone",
            "Are you my homework, cause I'm not doing you but I definitely should be",
            "On a scale of 1-10.. You're a 9 and I'm the 1 you're missing",
            "Are you the big bad wolf? Because I'm gonna leave you huffing and puffing",
            "You can call me WiFi, 'cause I'm pretty much guaranteed to go down on you",
            "If I were a letter I'd be a Q, because I always want to be next to U",
            "Hey girl, know what this sweater is made out of? Boyfriend material",
            "Are you on a United flight? Because I'd hit that",
            "Hey girl, are you a noose? Because I'd like to have your arms wrapped around my neck, comforting my pitiful existence",
            "Hey, are you an American voter by any chance? Because I was hoping I could convince you to make a stupid choice you'd later regret",
            "Did it hurt? When you fell from someone's ass and hit the toilet, you piece of shit",
            "I hope you like limbo, because I set a pretty low bar",
            "Are you from Tennessee? Because you look inbred as fuck",
            "I hope you've got pet insurance... because I'm going to kill your dog",
            "Damn girl, are you my GPA?  Because I know I could do better, I'm just too lazy to actually try",
            "Hey girl, are you a newspaper? Because there is a new issue with you every fucking day",
            "Did you fall from Heaven? Because your face looks like it hit the ground pretty hard"
        ]
    },
    {
        "intent": "fun.insult",
        "utterances": [
            "tell me an insult",
            "insult me",
            "fuck you",
            "you look ugly",
            "you suck",
            "fuck off",
            "asshole",
            "you're an idiot",
            "i fucking hate you",
            "shut the fuck up",
            "you're fucking stupid",
            "you are so fucking dumb",
            "you are an idiot"
        ],
        "answers": [
            "You know, you are a classic example of the inverse ratio between the size of the mouth and the size of the brain",
            "You're about as much use as a condom machine in the Vatican",
            "Freaking idiot",
            "Hey, where'd you get those clothes, the toilet store?",
            "If I wanted a joke, I'd follow you into the John and watch you take a leak",
            "There’s no more faith in thee than in a stewed prune",
            "Thou art a boil, a plague sore",
            "Thou art as fat as butter"
        ]
    }
]